import Divider from "../components/Divider/Divider";
import LearningModule from "../components/Learning/Learning";
import NavbarBottom from "../components/Navbar/NavbarBottom/NavbarBottom";
import NavbarTop from "../components/Navbar/NavbarTop/NavbarTop"
import audio from '../assets/audio/story.mp3';
import { useParams } from "react-router-dom";

const LearningPage = () => {
    const params = useParams();
    return (
        <>
            <NavbarTop />
            <Divider />
            <LearningModule id={params.id} backgroundImageUrl={'https://sun9-61.userapi.com/impg/Hm3hJAQ7UNEb2a9utsQMY7dTIkzkXc8CKcDGvg/kO9SRGWTm2w.jpg?size=959x508&quality=96&sign=2229c8f7482a191dd0ad514e24996ca3&c_uniq_tag=W4dzlOzgTnVslQfOeDyRFkfxCIQmne99saVidjxvZI0&type=album'} 
                            readContent={`Бірінші бөлім: Бір-көзді дәу мен Етікші
                            Ерте заманда бір кедей етікші болыпты. Бала-шағасы көп екен. Үй-ішін асырау үшін ол ел аралап, қобдиын құшақтап жүріп, етік тігіпті. Күндердің күнінде қобдиын қолтықтап, таныс емес бір ауылға аттанады. Бұрын жүрмеген жолы болған соң, етікші адасып кетеді. Түн болады. Ақырында, етікші далада жалғыз тұрған иесіз үйге кездеседі. Иесіз қыстаудың ішіне кірген етікші пештің үстіне шығып, қобдиын басына төсеп жата кетеді. Бір уақытта салдыр-гүлдір еткен бір нәрсенің даусы шығады. Етікші есікке қараса маңдайында жарқыраған жалғыз көзі бар, бір еңгезердей дәу кіріп келе жатыр екен.
                            — Пеш үстінде жатқан қандай адам? – деп сұрайды дәу. Етікші:
                            — Бұл - етікші, – деп жауап береді.
                            — Бізге керек шебер етікшімісің? – дейді. Сонан соң дәу бұйырып:
                            — Кәне, бері кел, шебер, мына үйге кір. Егер ертеңге дейін бір керемет етік тіксең, жаның аман қалады. Ал, егер орындамасаң, басыңды аламын, – дейді де етікшіні ішке кіргізеді.
                            Дәудің өзі есіктің алдына жатып ұйқыға кіріседі. Етікші ішінен:
                            — Енді өмірім жойылды, өліп кетсем, бала-шағамды кім асырар екен? – деп үрейленеді.
                            Екінші бөлім: Етікшінің шеберлігі мен жоспары
                            Амалы таусылған етікші таң атқанша отырып ғажайып етік тігеді. Етіктің сыртқы көрінісінің басқа етіктерден айырмашылығы - ұшы тіп-тік сүйір, жоғары көтеріліп тұрады. Ал оның бір керемет қасиеті - аяғына киген адам аспанға
                            қалықтап ұшып, баратын жеріне лезде жетіп барады. Бірақ ол дәудің оны оңай үйіне жібере қоймасын біліп:
                            — Бәрібір дәу қолынан өлемін. Одан гөрі бұл дәуді өзім өлтірейін, – деп, өткір пышағын алады.
                            Дәу ұйқыға кетті-ау деген кезде, етікші етігін киіп, сыртқа шығады. Қалықтап ұшқан күйі қолындағы пышағымен дәудің жалғыз көзін түйреп алады. Дәу бақырып:
      `}
                            audioSrc={audio}/>
            <NavbarBottom />
        </>
    )
}

export default LearningPage;