import Divider from "../components/Divider/Divider";
import Grammar from "../components/Grammar/Grammar";
import NavbarBottom from "../components/Navbar/NavbarBottom/NavbarBottom";
import NavbarTop from "../components/Navbar/NavbarTop/NavbarTop"

const QuizzGrammar = () => {
    const excerpt = "Ертеде, қылышынан қан тамған қаһарлы бір ханның жалғыз қызы бойжеткенде бір кедей жігітке ғашық болып, көңіл қосып жүреді екен. Мұны біліп қойған хан  жігітті дарға астырады. Жігіт өлгеннен кейін қыз мезгіліне жетпей, бір ұл, бір қыз табады.Көп көзінен, ел сөзінен сескенген хан жаман атқа қалмаудың амалын іздеп, қос бүлдіршіннің көзін жоюды астыртын мыстан кемпірге тапсырады.  Мыстан кемпір өмірге жаңа келген сәбилерді көз көрмес, құлақ естімес жерге апарып, биік өскен  жап-жасыл ағаштың  басына қызды – шығысқа, ұлды – батысқа қаратып іліп кетеді. Нәрестелердің  көз жасы тамған ағаш бұтақтары суалып, қуара бастайды. Қос жүрек соғуын тоқтатқанда, бәйтерек те өсуін доғарады.";
    const questions = [
      { text: "Амалын", options: ["Сан есім", "Зат есім", "Етістік", "Сын есім", "Үстеу", "Есімдік", "Шылау"] },
      { text: "Жүреді", options: ["Сан есім", "Зат есім", "Етістік", "Сын есім", "Үстеу", "Есімдік", "Шылау"] },
      { text: "Бір", options: ["Сан есім", "Зат есім", "Етістік", "Сын есім", "Үстеу", "Есімдік", "Шылау"] },
      { text: "Қос", options: ["Сан есім", "Зат есім", "Етістік", "Сын есім", "Үстеу", "Есімдік", "Шылау"] },
      { text: "Қаһарлы", options: ["Сан есім", "Зат есім", "Етістік", "Сын есім", "Үстеу", "Есімдік", "Шылау"] },
    ];

        const title = "Берілген мәтінді оқи отырып, белгіленген сөздердің сөз табын анықта:";
    return (
        <>
            <NavbarTop />
            <Divider />
            <Grammar excerpt={excerpt} title={title} questions={questions}  />
            <NavbarBottom />
        </>
    )
}

export default QuizzGrammar;